const popupSection = document.querySelector(".popup");
const overlay = document.querySelector(".overlay");
const closebtn = document.querySelector(".closebtn");
const imgTitlePopup = document.querySelector(".img-title-popup");
const popupParagraph = document.querySelector(".popup-p");
const popupSignature = document.querySelector(".popup-signature");
const popupContainer = document.querySelector(".popup-container");
const btnForPopup = [...document.querySelectorAll(".btn-for-popup")];

const data = [
  {
    title: "למה מרכזי הטניס והחינוך",
    desc: `.	אנו עובדים כל השנה - כולל חוה"מ והחופש הגדול
2.	אנחנו בית הספר הגדול ביותר לטניס בעולם
3.	מרכזי הטניס והחינוך מאפשרים לילד להתאמן / לשחק ולנוח גם מעבר לשעות האימון
4.	רוב אלופי ישראל צמחו אצלנו
5.	הטניס מעניק ערכים כמו: מצוינות, מנהיגות, משמעת עצמית ועוד
6.	הטניס תורם להעלאת הביטחון העצמי
7.	הטניס מחזק את הכישורים החברתיים של השחקן
8.	פעילות הטניס תורמת לשמירה על אורח חיים בריא
9.	הטניס מלמד להתמודד עם אי הצלחות, חשיבה תחת לחץ, קבלת החלטות ועוד.`,
  },
  {
    title: "טניס קטנטנים | 3-7",
    desc: `אף ילד לא נולד עדיין אלוף טניס. כשעוסקים בספורט לילדים, יש להקפיד על הדרגתיות בחשיפה לענף ובלימוד המשחק. תכנית טניס קטנטנים מיועדת לשלב הראשוני ביותר ומפתחת אצל הילדים אהבה לתנועה ולפעילות הספורטיבית. התכנית מעניקה לילדים בגילאי 3-7 יסודות חשובים ומרכזיים במגוון ענפי ספורט ובפרט ללימוד משחק הטניס, באמצעות פעילות מאתגרת, מהנה ומגוונת.
באמצעות משחקים ותרגילי יסוד הכוללים שימוש במחבטים, כדורים ועזרי אימון לגיל הרך, התכנית מסייעת לילדים לפתח מיומנויות מוטוריות וגופניות חשובות כמו קואורדינציה, שיווי משקל ומהירות. במקביל להם תורמת הפעילות בשורה של היבטים רגשיים וחברתיים, ובהם שיפור הביטחון והדימוי העצמי והיכולת לשיתוף פעולה ועבודת צוות. התכנית בהדרכת מדריכים ומאמנים מוסמכים ומורים לחינוך גופ`,
  },
  {
    title: "טניס | 7-18",
    desc: `התכנית מתמקדת בשיפור רמת המשחק ומאפשרת לילדים להשתתף לראשונה בתחרויות פנימיות, תחרויות רשמיות ובמשחקי ליגה.
אל תתפשרו על "סתם" חוג טניס. תכנית הטניס שלנו לגילאים 7-18 מתמקדת בשיפור רמת המשחק ומאפשרת למתאמנים ללמוד את מכלול מרכיבי המשחק: טכניקה, טקטיקה, כושר פיזי, יכולת מנטאלית ועוד; להשתתף לראשונה בתחרויות פנימיות, תחרויות רשמיות ובמשחקי ליגה. דגש מיוחד מושם במהלך התכנית על שיפור היכולות הטכניות והקניית יסודות טקטיים ומנטאליים כמפתחות להנאה ולהישגים על המגרש. במהלך השנה ייהנו הילדים מפעילויות נוספות כגון מחנות אימונים, טיולים, פעילויות גיבוש, קייטנות בחגים ובחופשות ביה"ס ועוד. התכנית בהדרכת מדריך/מאמן טניס מוסמך וניתן לשלב בה אימוני כושר וכוח בהתאמה לגיל המשתתף.
`,
  },
  {
    title: "טניס תחרותי | 10-18",
    desc: `תכנית אינטנסיבית ומקיפה המעניקה לשחקנים מוכשרים ובעלי כושר התמדה את ההזדמנות להיעשות לשחקנים מקצועניים.
תכנית מקיפה ואינטנסיבית של בית הספר לטניס, המפתחת מצוינות בכל רובדי המשחק. שחקני טניס מוכשרים ובעלי כושר התמדה יקבלו את ההזדמנות להפוך את הטניס לדרך חיים ולקריירה, דרך שלושה מסלולים: מסלול אימון והדרכה, מסלול קולג' ומסלול שחקנים מקצועיים. במהלך התכנית, הכוללת השתתפות בתחרויות אזוריות, ארציות ובמשחקי ליגה, משפרים המשתתפים את מכלול מרכיבי המשחק: טכניקה, טקטיקה, כושר פיזי, יכולת מנטאלית ועוד. התכנית בהדרכת אנשי מקצוע ומאמנים מהטובים בענף, בראשם רונן מורלי (לשעבר מאמן נבחרת הדיוויס וכיום מנהל תחום הכשרות ונבחרות ארציות), אנה סמאשנובה (דורגה בשיאה 15 בעולם) ועוד.
`,
  },
  {
    title: "טניס קלאב",
    desc: `השחקנים יוכלו ליהנות מהמשחק בתכנית המיועדת לכל גיל ולכל רמה: מתחילים או מתקדמים
הטניס קלאב מיועד לבוגרים בכל רמה. כל אימון טניס במסגרת התכנית מותאם במיוחד לגילם ולרמת המשחק של המשתתפים ותורם לשיפור היכולת הגופנית וכישורי המשחק שלהם. המתחילים מתמקדים בלימוד יסודות וחוקי המשחק, טכניקות בסיסיות, מצבי משחק ועוד. המתקדמים משפרים את הטכניקה, לומדים טקטיקה מתקדמת, מתנסים במשחקי טניס ברמה גבוהה ואף יכולים להשתלב בליגות ובתחרויות טניס לבוגרים. בפני המשתתפים בתכנית יפתחו פעילויות מגוונות נוספות במהלך השנה, כגון טיולי טניס לחו"ל, ימי גיבוש, העשרות מקצועיות ועוד. האימונים בתכנית טניס קלאב  בהדרכת מדריך/מאמן טניס מוסמך של בית הספר לטניס.

`,
  },
  {
    title: "כושר",
    desc: `מגוון רחב של תכניות כושר ותנועה לנוער ולמבוגרים, כפעילות משלימה לטניס או כפעילויות בפני עצמה.
במרוצת השנים מרכזי הטניס שלנו התפתחו והסתעפו, וכיום אנו מציעים מגוון רחב של תכניות כושר ותנועה אשר משולבות עם הטניס, תחום החשוב ביותר להתפתחות הטניסאים ולשמירה על קריירה ארוכה ובריאה.
בנוסף, חלק מהמרכזים מציעים את תכנית הכושר כתוכנית אינדיבידואלית שאינה חלק מחבילת הטניס.
`,
  },
];

btnForPopup.forEach((btn, i) => {
  btn.addEventListener("click", (e) => {
    popupSection.classList.remove("hidden");
    popupContainer.className = "popup-container";
    popupContainer.classList.add(`gr-${i + 1}-row`);

    const imgPopIcon = imgTitlePopup.querySelector("img");
    const popTitle = imgTitlePopup.querySelector("span");
    imgPopIcon.setAttribute("src", `/imgs/icons/${i + 1}-icon.png`);
    popupParagraph.textContent = data[i].desc;
    popTitle.textContent = data[i].title;
  });
});
closebtn.addEventListener("click", (e) => {
  popupSection.classList.add("hidden");
});
overlay.addEventListener("click", (e) => {
  popupSection.classList.add("hidden");
});
